Repository: tgandor/meats
Catalog: trunk/pvicig/locale/*/LC_MESSAGES/pvicig.po
Languages: pl

source: %d: unexpected character `%c'
pl: %d: niespodziewany znak `%c'

source: '%c' (%d) illegal charcter at line %d
pl: '%c' (%d) niedozwolony znak w linii %d

source: unexpected EOF inside comment at line %d
pl: niespodziewany koniec pliku wewn±trz komentarza w linii %d

source: Number of tiles: %d
pl: Liczba kafli: %d

source: Fragment of %s:
pl: Fragment pliku %s

source: Tiles: %d, Sum: %d
pl: Liczba kafli: %d, Suma d³ugo¶ci: %d

source: Metrics values:
pl: Warto¶ci metryk:

source: Comparing %s and %s
pl: Porównywanie %s i %s

source: Atoms:
pl: Atomy:

source: Too short minimal match length.
pl: Zbyt ma³a warto¶æ dla najkrótszego dopasowanego kafla.

source: Wrong Greedy String Tiling parameters.
pl: B³êdne warto¶ci parametrów dla algorytmu GST.

source: Too low Karp Rabin base.
pl: Zbyt ma³a podstawa (czynnik) dla algorytmu KR.

source: Too low Karp Rabin modulus.
pl: Zbyt ma³y parametr modulus dla algorytmu KR.

source: Karp Rabin modulus must be prime.
pl: Parametr modulus algorytmu Karpa Rabina musi byæ liczb± pierwsz±.

source: We want Karp Rabin base to be prime too.
pl: Dla lepszego rozpraszania czynnik w algorytmie KR równie¿ powinien byæ liczb± pierwsz±.

source: Too large Karp Rabin parameters (overflow).
pl: Zbyt du¿e warto¶ci parametrów algorytmu Karpa Rabina (przepe³nienie).

source: `%s' - copy detection program
pl: `%s' - program wykrywania podobieñstw

source: Usage: %s [OPTION]... ARGUMENTS
pl: U¿ycie: %s [OPCJA].. ARGUMENTY

source: If a long option shows an argument as mandatory, then it is mandatory for the equivalent short option also. Similarly for optional arguments.
pl: Arumenty opcjonalne dla d³ugich opcji s± równie¿ opcjonalne dla krótkich. Podobnie argumenty wymagane s± równie¿ wymagane.

source: General Options: -q, --quiet supress errors, warnings and excess information -v, --verbose output more detailed information -i, --indicate=FILENAME compare this file aganist all other arguments only -o, --output=FILENAME redirect stdout to file FILENAME --version print version and exit --help display this help message Algorithm Options: -t, --thereshold=VALUE only display comparisons which yield more than VALUE % --gst-start=VALUE for GST algorithm: initial search length --gst-min=VALUE minimal (final) tile length in GST algorithm --kr-base=VALUE the Karp Rabin multiplier --kr-mod=VALUE the Karp Rabin modulus --metrics use also atribute counting metric --only-metrics use only atribute counting metric --zero-same when comparing metrics, don't ignore zeros --use-cpp preprocess C files wich cpp before processing --source display source in verbose mode when displaying program --sort-asc sort results ascending (default: sort descending
pl: Opcje ogólne: -q, --quiet nie pokazuje b³êdów i rozszerzonej informacji -v, --verbose zwraca bardziej szczegó³owe informacje -i, --indicate=FILENAME tylko wskazany plik bêdzie porównywany -o, --output=FILENAME przekierowanie wyj¶cia do pliku --version wy¶wietlenie wersji programu i wyj¶cie --help wy¶wietlenie tej pomocy Opcje algorytmu: -t, --thereshold=VALUE pominiêcie wyników poni¿ej VALUE % (domy¶lnie: 50) --gst-start=VALUE pocz±tkowa d³ugo¶æ kafla w algorytmie GST --gst-min=VALUE minimalna (koñcowa) d³ugo¶æ kafla w GST --kr-base=VALUE podstawa (mno¿nik) w algorytmie Karpa Rabina --kr-mod=VALUE modu³ (liczba pierwsza) w algorymie KR --metrics zastosowanie miar liczbowych programu --only-metrics zastosowanie tylko miar liczbowych programu --zero-same przy miarach liczbowych -- branie zer pod uwagê --use-cpp przetwarzanie programów w C przez preprocesor --source wy¶wietlanie pe³nego ¼ród³a programu --sort-asc sortowanie wyników rosn±co (domy¶lnie: malej±co)

source: Report bugs to: <Tomasz.Gandor@gmail.com>
pl: Informacje o b³êdach: <Tomasz.Gandor@gmail.com>

source: Resetting GST initial to 2 * GST shortest.
pl: Zmiana pocz±tkowego s na 2 * GST-min.

source: Resetting GST initial to default.
pl: Reinicjalizacja pocz±tkowego s warto¶ci± domy¶ln±.

source: Resetting GST shortest to default.
pl: Reinicjalizacja GST-min warto¶ci± domy¶ln±.

source: Resetting Karp Rabin params to default.
pl: Reinicjalizacja parametrów algorytmu Karpa Rabina warto¶ciami domy¶lnymi.

source: Suspected file: %s
pl: Podejrzany plik: %s

source: The suspect program was't loaded correctly.
pl: Podejrzany program nie zosta³ za³adowany poprawnie.

source: The suspect program was't processed correctly.
pl: Podejrzany program nie zosta³ przetworzony poprawnie.

source: Not enough arguments.
pl: Zbyt ma³o argumentów.

source: Not enough unique arguments.
pl: Zbyt ma³o unikatowych argumentów.

source: File: `%s' not loaded correctly.
pl: Plik `%s' nie zosta³ za³adowany.

source: Not enough loaded programs.
pl: Zbyt ma³o za³adowanych poprawnie programów.

source: Program `%s' not processed.
pl: Program `%s' nie zosta³ przetworzony poprawnie.

source: Not enough processed programs.
pl: Zbyt ma³o programów poprawnie przetworzonych.

source: No program - null pointer
pl: Brak programu - pusty wska¼nik

source: Program contents:
pl: Zawarto¶æ programu:

source: Filename: %s
pl: Nazwa pliku: %s

source: --------- begin source ------------
pl: --------- pocz±tek kodu -----------

source: ---------- end source -------------
pl: --------- koniec kodu -------------

source: Number of lexical atoms: %d
pl: Liczba atomów leksykalnych: %d

source: Metrics values (as they follow, for reference read metrics.h):
pl: Warto¶ci metryk programu (ich znaczenie mo¿na sprawdziæ w pliku metrics.h

source: Processing program %s...
pl: Przetwarzanie programu %s...

source: File preprocessed.
pl: Plik przetworzony.

source: Processed.
pl: Przetworzone.
